src/DataProcessors/УдалитьНеПредопределённыеВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>УдалитьНеПредопределённыеВалюты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/УстановкаКурсаВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>УстановкаКурсаВалют</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КурсыВалют</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/УдалитьНеПредопределённыеВалюты/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура УдалитьВалютыНаСервере() 
    ЧислоДокументов       = 0;
    ЧислоВалют            = 0;
    #Область Отладка__ЧислоЗаписейВРегистре
    ЧислоЗаписейВРегистре = 0;
    #КонецОбласти     
    
    #Область УдалениеИзДокументаУстановкаКурсаВалют
    Запрос = Новый Запрос();
    // Параметры ГДЕ:
    // 1 - Все документы, где нет предопределённых валют (в том числе пустые)
    // 2 - Записи с другими валютами, в том числе где есть предопределённые валюты 

    Запрос.Текст = "ВЫБРАТЬ
                   |    УстановкаКурсаВалют.Ссылка КАК Ссылка
                   |ИЗ
                   |    Документ.УстановкаКурсаВалют КАК УстановкаКурсаВалют
                   |ГДЕ
                   |    (НЕ УстановкаКурсаВалют.Курсы.Валюта.Предопределенный
                   |            ИЛИ УстановкаКурсаВалют.Курсы.Валюта.Предопределенный = ЛОЖЬ)";
 
    РезультатЗапроса = Запрос.Выполнить();
    
    Если Не РезультатЗапроса.Пустой() Тогда
        
    	Выборка = РезультатЗапроса.Выбрать();
        Пока Выборка.Следующий() Цикл
            Документ = Выборка.Ссылка.ПолучитьОбъект();
        
            #Область Отладка__ЧислоЗаписейДоУдаления
            //Запрос = Новый Запрос("ВЫБРАТЬ
            //                      | КурсыВалют.Регистратор КАК Регистратор,
            //                      | КурсыВалют.НомерСтроки КАК НомерСтроки,
            //                      | КурсыВалют.Активность КАК Активность,
            //                      | КурсыВалют.Валюта КАК Валюта
            //                      |ИЗ
            //                      | РегистрСведений.КурсыВалют КАК КурсыВалют
            //                      |ГДЕ
            //                      | КурсыВалют.Период = &Период");
            //Запрос.УстановитьПараметр("Период", НачалоДня(Документ.Дата));
            //
            //НаборЗаписей = Запрос.Выполнить();
            //РегистрДо    = НаборЗаписей.Выгрузить();
            #КонецОбласти     
                
            Документ.Удалить();
            
            #Область Отладка__ЧислоЗаписейПослеУдаления 
            //НаборЗаписей = Запрос.Выполнить();
            //РегистрПосле = НаборЗаписей.Выгрузить();
            //ЧислоЗаписейВРегистре = ЧислоЗаписейВРегистре + РегистрДо.Количество() - РегистрПосле.Количество();
            #КонецОбласти     
            
            ЧислоДокументов = ЧислоДокументов+1;
        КонецЦикла;
    КонецЕсли;
    #КонецОбласти     
    #Область УдалениеИзСправочникаВалюты
    Валюты = Справочники.Валюты.Выбрать();
    Пока Валюты.Следующий() Цикл
        Валюта = Валюты.ПолучитьОбъект();
    	Если Не Валюта.Предопределенный Тогда
        
        	Валюта.Удалить();
            ЧислоВалют = ЧислоВалют+1;
        КонецЕсли; 
    КонецЦикла;
    #КонецОбласти 
    #Область Сообщение
    Текст = ?(ЧислоДокументов>0, " документов ""Установка курса валют"" - " + ЧислоДокументов, "");
    Текст = Текст + ?(ЧислоВалют>0, ?(Текст="","",",") + 
            " записей в справочнике ""Валюты"" - " + ЧислоВалют, "");
    #Область Отладка__ЧислоЗаписейВРегистреВывод
    //Текст = Текст + ?(ЧислоЗаписейВРегистре>0, ?(Текст="","",",") + 
    //        " записей в регистре сведений ""Курсы валют"" - " + ЧислоЗаписейВРегистре, "");
    #КонецОбласти 
    Если ЗначениеЗаполнено(Текст) Тогда
        Сообщить("Удалено:" + Текст);
    Иначе	
        Сообщить("Нет валют для удаления");
    КонецЕсли;
    #КонецОбласти 
       
КонецПроцедуры

&НаКлиенте
Процедура Действие(Код, Параметр) Экспорт
    Если Код = КодВозвратаДиалога.Да Тогда
        УдалитьВалютыНаСервере();
    КонецЕсли; 
КонецПроцедуры 

&НаКлиенте 
Процедура ОшибкаВопроса() Экспорт
    ВызватьИсключение "Не удалось вывести предупреждение об удалении";
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВалюты(Команда)
    Оп = Новый ОписаниеОповещения("Действие", ЭтотОбъект, , "ОшибкаВопроса", ЭтотОбъект);
    ПоказатьВопрос(Оп, 
                   "Удалить валюты и документы, связанные с ними?",
                   РежимДиалогаВопрос.ДаНет,
                   20, 
                   КодВозвратаДиалога.Нет ,
                   "Предупреждение");
КонецПроцедуры
